# weather data tidying and analysis.

In [1]:
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt

## Data loading using pd.read_csv.

In [2]:
data=pd.read_csv("weather.csv")
data.head()

,id,year,month,element,d1,d2,d3,d4,d5,d6,...,d22,d23,d24,d25,d26,d27,d28,d29,d30,d31
0,MX17004,2010,1,tmax,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,27.8,NaN
1,MX17004,2010,1,tmin,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,14.5,NaN
2,MX17004,2010,2,tmax,NaN,27.3,24.1,NaN,NaN,NaN,...,NaN,29.9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,MX17004,2010,2,tmin,NaN,14.4,14.4,NaN,NaN,NaN,...,NaN,10.7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,MX17004,2010,3,tmax,NaN,NaN,NaN,NaN,32.1,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Deleting the first "id" column since it is the same for all records.

In [3]:
data=data.drop(['id'],axis=1)
data.head()

,year,month,element,d1,d2,d3,d4,d5,d6,d7,...,d22,d23,d24,d25,d26,d27,d28,d29,d30,d31
0,2010,1,tmax,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,27.8,NaN
1,2010,1,tmin,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,14.5,NaN
2,2010,2,tmax,NaN,27.3,24.1,NaN,NaN,NaN,NaN,...,NaN,29.9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2010,2,tmin,NaN,14.4,14.4,NaN,NaN,NaN,NaN,...,NaN,10.7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2010,3,tmax,NaN,NaN,NaN,NaN,32.1,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Melting data to bring it to a proper readable dataframe format.

In [4]:
data_tidy=pd.melt(data,id_vars=['year','month','element'],var_name="day",value_name="value")
data_tidy.head()

   year  month element day  value
0  2010      1    tmax  d1    NaN
1  2010      1    tmin  d1    NaN
2  2010      2    tmax  d1    NaN
3  2010      2    tmin  d1    NaN
4  2010      3    tmax  d1    NaN

## Writing a function to convert day format i.e. from d1 to 1...d31 to 31.

In [5]:
def con_day(d):
    s=d[1:]
    if len(s)==1:
        s='0'+s
    return s

data_tidy['day'] = data_tidy['day'].apply(con_day)
data_tidy.head()

   year  month element day  value
0  2010      1    tmax  01    NaN
1  2010      1    tmin  01    NaN
2  2010      2    tmax  01    NaN
3  2010      2    tmin  01    NaN
4  2010      3    tmax  01    NaN

In [6]:
def con_mon(m):
    if len(str(m))==1:
        m='0'+str(m)
    return m

data_tidy['month'] = data_tidy['month'].apply(con_mon)
data_tidy.head()

   year month element day  value
0  2010    01    tmax  01    NaN
1  2010    01    tmin  01    NaN
2  2010    02    tmax  01    NaN
3  2010    02    tmin  01    NaN
4  2010    03    tmax  01    NaN

In [7]:
data_tidy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 682 entries, 0 to 681
Data columns (total 5 columns):
year       682 non-null int64
month      682 non-null object
element    682 non-null object
day        682 non-null object
value      66 non-null float64
dtypes: float64(1), int64(1), object(3)
memory usage: 26.8+ KB

In [8]:
data_tidy["date"] = data_tidy["year"].astype(str)+'-'+ data_tidy["month"].astype(str)+'-'+ data_tidy["day"].astype(str)
data_tidy.head()

   year month element day  value        date
0  2010    01    tmax  01    NaN  2010-01-01
1  2010    01    tmin  01    NaN  2010-01-01
2  2010    02    tmax  01    NaN  2010-02-01
3  2010    02    tmin  01    NaN  2010-02-01
4  2010    03    tmax  01    NaN  2010-03-01

In [9]:
data_tidy=data_tidy.drop(['year','month','day'],axis=1)
data_tidy.head()

  element  value        date
0    tmax    NaN  2010-01-01
1    tmin    NaN  2010-01-01
2    tmax    NaN  2010-02-01
3    tmin    NaN  2010-02-01
4    tmax    NaN  2010-03-01

In [10]:
data_tidy.isnull().sum()

element      0
value      616
date         0
dtype: int64

In [11]:
 data_tidy.isnull().sum().sum()

616

In [12]:
data_tidy.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 682 entries, 0 to 681
Data columns (total 3 columns):
element    682 non-null object
value      66 non-null float64
date       682 non-null object
dtypes: float64(1), object(2)
memory usage: 16.1+ KB

In [13]:
data_tidy=data_tidy.dropna()
data_tidy.head()

   element  value        date
20    tmax   29.9  2010-12-01
21    tmin   13.8  2010-12-01
24    tmax   27.3  2010-02-02
25    tmin   14.4  2010-02-02
40    tmax   31.3  2010-11-02

In [14]:
data_tidy.shape

(66, 3)

In [15]:
data_tidy['date']=pd.to_datetime(data_tidy['date'])
print(data_tidy.info())
data_tidy.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 66 entries, 20 to 675
Data columns (total 3 columns):
element    66 non-null object
value      66 non-null float64
date       66 non-null datetime64[ns]
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 2.1+ KB
None

   element  value       date
20    tmax   29.9 2010-12-01
21    tmin   13.8 2010-12-01
24    tmax   27.3 2010-02-02
25    tmin   14.4 2010-02-02
40    tmax   31.3 2010-11-02

In [16]:
data_tidy=data_tidy.pivot(index='date', columns='element', values='value')
data_tidy.head()

element     tmax  tmin
date
2010-01-30  27.8  14.5
2010-02-02  27.3  14.4
2010-02-03  24.1  14.4
2010-02-11  29.7  13.4
2010-02-23  29.9  10.7